Autodesk.Revit.DB.Events.DocumentCreatingEventArgs.DocumentType
Type of the document which is about to be created, e.g. Project or Template.
Since:
2010

Autodesk.Revit.DB.Events.DocumentCreatingEventArgs.Template
The template file path to be used for creating the new document.
Since:
2010

Autodesk.Revit.DB.Events.DocumentCreatingEventArgs
The event arguments used by the DocumentCreating event.
Since:
2010